natConvBox/case3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1516800;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1523200;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1529600;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1536000;
    }
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1542400;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       1548800;
    }
)

// ************************************************************************* //
